A, B = 1999.5, 2025  # заданий діапазон

x1 =int(A) + 1  # початкове значення (ціле, не менше A)
dx = 1  # крок зміни
count = 0  # лічильник високосних років

x = x1  # початкове значення змінної циклу

while x < B:  # поки не досягнемо межі B
    if (x % 400 == 0) or (x % 4 == 0 and x % 100 != 0):  # перевірка високосного року
        count = count + 1
    x = x + dx  # перехід до наступного числа

print("Кількість високосних років у діапазоні [", A, ";", B, ") =", count)


# Заданий діапазон [A; B)
A, B = 999, 1985

# Частина (x % 4 == 0)
k4 = 4
N_4 = ((B - 1) // k4) - ((A - 1) // k4)

# Частина (x % 100 == 0) - це роки, які ми повинні ВИКЛЮЧИТИ з N_4
k100 = 100
N_100 = ((B - 1) // k100) - ((A - 1) // k100)

# Частина (x % 400 == 0) - це роки, які ми повинні ВКЛЮЧИТИ назад
k400 = 400
N_400 = ((B - 1) // k400) - ((A - 1) // k400)

count_leap_years = N_4 - N_100 + N_400

# --- Вивід результату ---

print(f"Заданий діапазон: [{A}; {B})")
print(f"Роки, кратні 4:",N_4)
print(f"Роки, кратні 100:",N_100)
print(f"Роки, кратні 400:", N_400)
print(f"Кількість високосних років =", count_leap_years)

A, B = 745, 2025# заданий діапазон

start_year = int(A)

remainder = start_year % 4

if remainder == 0:
    first_leap_year = start_year
else:
    first_leap_year = start_year + (4 - remainder)

count = 0  # лічильник високосних років

x = first_leap_year

print(f"Перший високосний рік у діапазоні [",start_year,";",B,")", first_leap_year)
print("Високосні роки в діапазоні:")

# Обхід циклом з кроком +4
while x < B:
    count = count + 1
    print(x)
    x = x + 4 # перехід до наступного високосного року

print(f"Кількість високосних років у діапазоні [",A,";", B,") =", count)