# Введення координат
A = int(input("Введіть A: "))
B = int(input("Введіть B: "))

print("Точка має координати:", "(", A, ",", B, ")")

# Перевірка 1: чи не є точка центром квадрата
if A == 0 and B == 0:
    print("Це центр квадрата, а не кут.")

# Перевірка 2: чи лежить точка на одній з осей
if (A == 0 and B != 0) or (B == 0 and A != 0):
    print("Точка лежить на осі координат і не є кутом квадрата.")

# Перевірка 3: чи виконується умова |A| = |B|
if abs(A) == abs(B) and A != 0 and B != 0:
    print("Так, ця точка є кутом квадрата з центром у (0, 0).")

# Перевірка 4: усі інші випадки
if not (A == 0 and B == 0) and not ((A == 0 and B != 0) or (B == 0 and A != 0)) and not (abs(A) == abs(B) and A != 0 and B != 0):
    print("Ні, ця точка не є кутом квадрата.")
