# Введення п’яти цілих чисел
x1 = int(input("Введіть x1: "))
x2 = int(input("Введіть x2: "))
x3 = int(input("Введіть x3: "))
x4 = int(input("Введіть x4: "))
x5 = int(input("Введіть x5: "))

# Ініціалізація лічильника повторів
count = 0

# Перевірка для x1
if (x1 == x2) or (x1 == x3) or (x1 == x4) or (x1 == x5):
    count = count + 1

# Перевірка для x2 (щоб не рахувати однакове двічі)
if (x2 == x3) or (x2 == x4) or (x2 == x5):
        count = count + 1

# Перевірка для x3
if (x3 == x4) or (x3 == x5):
        count = count + 1

# Перевірка для x4
if (x4 == x5):
        count = count + 1

# Виведення результату
print("Кількість чисел, що повторюються більш ніж один раз:", count)

