city_name = "Вінниця"                                           # Назва міста
country = "Україна"                                             # Країна в якій розташоване місто
region = "Вінницька область"                                    # Назва області
river = "Південний Буг"                                         # Річка, яка протікає через місто
famous_place = "Національний музей-садиба М.І. Пирогова"        # Відоме місце міста

population = 356                                                # Населення міста станом на 1 липня 2025 року (тисяч осіб)
number_of_districts = 6                                         # Кількість районів
foundation_year = 1363                                          # Рік заснування
universitets = 5                                                # Кількість університетів у місті
schools = 55                                                    # Кількість шкіл станом на 2025 рік

area = 113.2                                                    # Площа Вінниці (км²)
birth_rate = 11.1                                               # Кофіцієнт народжуваності в Вінниці станом на 2014 рік (%)
flat_rental = 386.50                                            # Середня вартість орендт 2-кімнатної квартири в місті ($)
average_salary = 546.92                                         # Середня зарплата в місті за даними Work.ua ($)
max_temperature = 37.0                                          # Максимальна температура станом на 7 липня 2025 року (°C)


print("Назва міста:", city_name)
print("Країна в якій розташована:", country)
print("Назва області:", region)
print("Річка яка протікає через Вінницю:", river)
print("Відоме місце Вінниці:", famous_place)

print()

print("Населення Вінниці станом на 1 липня 2025 року:", population, "тисяч осіб")
print("Кількість районів:", number_of_districts)
print("Рік заснування:", foundation_year)
print("Кількість університетів у Вінниці:", universitets)
print("Кількість шкіл у Вінниці станом на 2025 рік:", schools)

print()

print("Площа Вінниці", area, "км²")
print("Кофіцієнт народжуваності станом на 2014 рік:", birth_rate, "%")
print("Середня вартість оренди 2-кімнатної квартири:", flat_rental, "$")
print("Середня вартість орендт 2-кімнатної квартири в Вінниці:", average_salary, "$")
print("Максимальна температура станом на 7 липня 2025 року:", max_temperature, "°C")
